In [1]:
import pandas as pd

data = {
    'Product_ID': [101, 102, 103, 104, 105],
    'Product_Name': ['Laptop', 'Smartphone', 'Tablet', 'Headphones', 'Smartwatch'],
    'Category': ['Electronics', 'Electronics', 'Electronics', 'Accessories', 'Electronics'],
    'Price': [1200, 800, 400, 100, 300],
    'Quantity_Sold': [50, 100, 80, 200, 120]
}

products = pd.DataFrame(data)
products

   Product_ID Product_Name     Category  Price  Quantity_Sold
0         101       Laptop  Electronics   1200             50
1         102   Smartphone  Electronics    800            100
2         103       Tablet  Electronics    400             80
3         104   Headphones  Accessories    100            200
4         105   Smartwatch  Electronics    300            120

In [3]:
products["Total revenue"] = products["Price"] * products["Quantity_Sold"]
products

   Product_ID Product_Name     Category  Price  Quantity_Sold  Total revenue
0         101       Laptop  Electronics   1200             50          60000
1         102   Smartphone  Electronics    800            100          80000
2         103       Tablet  Electronics    400             80          32000
3         104   Headphones  Accessories    100            200          20000
4         105   Smartwatch  Electronics    300            120          36000

In [4]:
products["Total revenue"].sum()

228000

In [10]:
products["Price"].mean()

560.0

In [9]:
products["Quantity_Sold"].mean()

110.0

In [11]:
products["Price"].median()

400.0

In [12]:
products["Quantity_Sold"].median()

100.0

In [13]:
pd.concat([products, products], axis=1)

,Product_ID,Product_Name,Category,Price,Quantity_Sold,Total revenue,Product_ID,Product_Name,Category,Price,Quantity_Sold,Total revenue
0,101,Laptop,Electronics,1200,50,60000,101,Laptop,Electronics,1200,50,60000
1,102,Smartphone,Electronics,800,100,80000,102,Smartphone,Electronics,800,100,80000
2,103,Tablet,Electronics,400,80,32000,103,Tablet,Electronics,400,80,32000
3,104,Headphones,Accessories,100,200,20000,104,Headphones,Accessories,100,200,20000
4,105,Smartwatch,Electronics,300,120,36000,105,Smartwatch,Electronics,300,120,36000

In [18]:
products.loc[2, "Price"] = pd.NA
products.loc[3, "Quantity_Sold"] = pd.NA
products.loc[2, "Price"] = products["Price"].mean()
products.loc[3, "Quantity_Sold"] = products["Quantity_Sold"].mean()
products

   Product_ID Product_Name     Category   Price  Quantity_Sold  Total revenue
0         101       Laptop  Electronics  1200.0           50.0          60000
1         102   Smartphone  Electronics   800.0          100.0          80000
2         103       Tablet  Electronics   600.0           80.0          32000
3         104   Headphones  Accessories   100.0           87.5          20000
4         105   Smartwatch  Electronics   300.0          120.0          36000

In [19]:
products.dropna()

   Product_ID Product_Name     Category   Price  Quantity_Sold  Total revenue
0         101       Laptop  Electronics  1200.0           50.0          60000
1         102   Smartphone  Electronics   800.0          100.0          80000
2         103       Tablet  Electronics   600.0           80.0          32000
3         104   Headphones  Accessories   100.0           87.5          20000
4         105   Smartwatch  Electronics   300.0          120.0          36000